In [50]:
import pandas as pd
import janitor

In [7]:
weather1=pd.read_csv("../datasets/monthly_max_temp.csv", index_col='Month')

In [8]:
weather1.head()

       Max TemperatureF
Month
Jan                  68
Feb                  60
Mar                  68
Apr                  84
May                  88

In [6]:
weather1

   Month  Max TemperatureF
0    Jan                68
1    Feb                60
2    Mar                68
3    Apr                84
4    May                88
5    Jun                89
6    Jul                91
7    Aug                86
8    Sep                90
9    Oct                84
10   Nov                72
11   Dec                68

Sort the index of weather1 in alphabetical order

In [11]:
weather2 = weather1.sort_index()

In [12]:
weather2

       Max TemperatureF
Month
Apr                  84
Aug                  86
Dec                  68
Feb                  60
Jan                  68
Jul                  91
Jun                  89
Mar                  68
May                  88
Nov                  72
Oct                  84
Sep                  90

Sort the index of weather1 in reverse alphabetical order

In [13]:
weather3=weather1.sort_index(ascending=False)

In [14]:
weather3

       Max TemperatureF
Month
Sep                  90
Oct                  84
Nov                  72
May                  88
Mar                  68
Jun                  89
Jul                  91
Jan                  68
Feb                  60
Dec                  68
Aug                  86
Apr                  84

Sorting according to column

In [17]:
weather1.sort_values("Max TemperatureF",ascending=False)

       Max TemperatureF
Month
Jul                  91
Sep                  90
Jun                  89
May                  88
Aug                  86
Apr                  84
Oct                  84
Nov                  72
Jan                  68
Mar                  68
Dec                  68
Feb                  60

Reindexing

In [20]:
weather1=pd.read_csv("../datasets/weather1.csv", index_col='Month')

In [21]:
weather1

       Mean TemperatureF
Month
Apr            61.956044
Jan            32.133333
Jul            68.934783
Oct            43.434783

In [25]:
year=['Jan',
 'Feb',
 'Mar',
 'Apr',
 'May',
 'Jun',
 'Jul',
 'Aug',
 'Sep',
 'Oct',
 'Nov',
 'Dec']

In [26]:
weather1.reindex(year)

       Mean TemperatureF
Month
Jan            32.133333
Feb                  NaN
Mar                  NaN
Apr            61.956044
May                  NaN
Jun                  NaN
Jul            68.934783
Aug                  NaN
Sep                  NaN
Oct            43.434783
Nov                  NaN
Dec                  NaN

In [29]:
weather1.reindex(year).ffill()

       Mean TemperatureF
Month
Jan            32.133333
Feb            32.133333
Mar            32.133333
Apr            61.956044
May            61.956044
Jun            61.956044
Jul            68.934783
Aug            68.934783
Sep            68.934783
Oct            43.434783
Nov            43.434783
Dec            43.434783

# Reindexing using another DataFrame Index

In [33]:
import glob
filenames = glob.glob("/Users/actify/Downloads/namesbystate/*.TXT")

In [42]:
df_list = [pd.read_csv(file, names=['State', 'Gender', 'Year', 'Name' ,'Age'], header=None) for file in filenames]

In [48]:
baby_names_df = pd.concat(df_list).reset_index(drop=True)

In [51]:
baby_names_df=baby_names_df.clean_names()

In [55]:
names_1981=baby_names_df[baby_names_df['year'] == 1981]

In [61]:
names_1910= baby_names_df[baby_names_df['year'] ==  1910]

In [62]:
names_1981.shape, names_1910.shape

((59397, 5), (16829, 5))

In [65]:
names_1981=names_1981.groupby(['name', 'gender'])['state'].count()

In [66]:
names_1981

name     gender
Aaliyah  F          2
Aaron    F         14
         M         51
Aarti    F          1
Abagail  F          1
                   ..
Zulay    F          1
Zuleika  F          1
Zulema   F          4
Zulma    F          1
Zvi      M          1
Name: state, Length: 6275, dtype: int64

In [67]:
names_1910=names_1910.groupby(['name', 'gender'])['state'].count()

In [68]:
names_1910

name     gender
Aaron    M         13
Abbie    F          4
Abe      M          4
Abner    M          2
Abraham  M          6
                   ..
Zoe      F          2
Zola     F          4
Zona     F          1
Zora     F          3
Zula     F          5
Name: state, Length: 1775, dtype: int64

In [70]:
names_1981.reindex(names_1910.index).dropna().shape

(1146,)